# 1. 강의소개

# ## 2. 파이썬 - 데이터분석을 위한 실습환경 준비하기
# 2. 온라인 데이터분석 소개
# 3. 온라인 아나콘다 설치(Windows10)
# 4. 온라인 주피터노트북 사용법

# ## 3. 파이썬 - 기본자료형 다루기
# 5. 온라인 파이썬 시작하기
# 6. 온라인 기본자료형과 변수
# 7. 온라인 산술연산, 문자열연산
# 8. 온라인 문자열 다루기

# ## 4. 파이썬 - 프로그램의 흐름 제어하기 (알고리즘)
# 9. 온라인 조건에 따라 분기하기(if)
# 10. 온라인 횟수로 반복하기(for)
# 11. 온라인 조건으로 반복하기(while)
# 12. 온라인 알고리즘 연습하기

# ## 5. 파이썬 - 데이터 처리의 기초 리스트와 튜플
# 13. 온라인 리스트와, 튜플 만들기
# 14. 온라인 인덱싱과 슬라이싱
# 15. 온라인 리스트 변경하기(추가,수정,삭제)
# 16. 온라인 리스트 다양하게 활용하기
# 17. 온라인 리스트 연습하기

# ## 6. 파이썬 - 키와 값의 쌍으로 된 데이터, 딕셔너리
# 18. 온라인 딕셔너리 만들고 값 추출하기
# 19. 온라인 딕셔너리 변경하기
# 20. 온라인 딕셔너리의 키, 값 다루기
# 21. 온라인 딕셔너리 연습하기

# ## 7. 파이썬 - 코드를 모아 만드는 함수
# 22. 온라인 함수 만들기
# 23. 온라인 함수의 결과값 받아서 사용하기
# 24. 온라인 인수 전달방법
# 25. 온라인 함수에서 변수 사용하기
# 26. 온라인 람다표현식과 map함수

# ## 8. 파이썬 - 라이브러리 사용을 위한 모듈, 패키지, 클래스의 이해
# 27. 온라인 클래스와 객체
# 28. 온라인 모듈과 패키지
# 29. 온라인 모듈 사용하기

# ## 9. 파이썬 - 데이터분석을 위한 판다스 시작하기
# 30. 온라인 판다스 데이터의 구조
# 31. 온라인 데이터 확인하기
# 32. 온라인 시리즈 다루기

# ## 10. 파이썬 - 데이터 추출하고 그래프 그리기
# 33. 온라인 컬럼명으로 데이터 추출하기
# 34. 온라인 인덱스, 컬럼명으로 데이터 추출하기
# 35. 온라인 행번호, 열번호로 데이터 추출하기
# 36. 온라인 기본 그래프 그리기

# ## 11. 파이썬 - 데이터 가공하기
# 37. 온라인 열 변경하기
# 38. 온라인 행 변경하기
# 39. 온라인 데이터에 함수 적용하기
# 40. 온라인 결측치 처리하기

# ## 12. 파이썬 - 판다스 자료형 다루기
# 41. 온라인 자료형 변환하기
# 42. 온라인 카테고리형 자료 다루기
# 43. 온라인 시계열 자료 다루기

# ## 13. 파이썬 - 데이터프레임 그룹핑과 재구조화
# 44. 온라인 데이터프레임 연결하기(concat, merge)
# 45. 온라인 행과 열의 형태 변경하기(melt, pivot)
# 46. 온라인 피봇테이블로 데이터 집계하기(pIvot_table)
# 47. 온라인 그룹별 데이터 집계하기(groupby)

# ## 14. 파이썬 - 서울시 코로나19 현황 분석
# 48. 온라인 데이터 준비하기
# 49. 온라인 데이터 확인 및 전처리
# 50. 온라인 서울시 일별 추가확진자 동향
# 51. 온라인 서울시 구별 추가확진자 및 접촉력 분석

# ## 15. 파이썬 - 서울시 공공자전거 이용 현황 분석
# 52. 온라인 데이터 수집 및 전처리
# 53. 온라인 일별 이용현황 분석
# 54. 온라인 시간대별 대여/반납 현황 분석
# 55. 온라인 대여소별 대여/반납 현황 분석

# ## 16. 파이썬 - 서울시 물가정보 분석
# 56. 온라인 데이터 수집 및 전처리
# 57. 온라인 구별/마트별 삼겹살 가격 분석
# 58. 온라인 구별/마트별 달걀 가격 분석

# ## 17. 파이썬 - 지하철 승하차 현황 분석
# 59. 온라인 데이터 수집 및 전처리
# 60. 온라인 출퇴근시간 승하차분석
# 61. 온라인 지하철 역별/시간대별 승하차 현황 분